core-concepts/03_configmaps-secrets/README.org
* Configuring applications with configmaps and secrets

  Create the following configmap's

  #+begin_src sh
oc create cm run --from-file=run.sh
oc create cm config --from-file=configuration=mainconfig.yml --from-file=anotherconfig.yml
oc create cm podenv --from-literal=variable=myvalue
  #+end_src

  Create the following secret

  #+begin_src sh
oc create secret generic geheim --from-literal=secret=nobody_knows
  #+end_src

  Start a pod with

  #+begin_src
oc apply -f not-so-simple-pod.yml
  #+end_src

  Take a look at pod.yml and try to understand how it works

* Cleanup

   Execute

   #+begin_src sh
../../utils/cleanup.sh
   #+end_src
